snlkuharlocal/src/Documents/ПроверкаПоставкиМаркированногоТовара/ПроверкаПоставкиМаркированногоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроверкаПоставкиМаркированногоТовара</name>
  <basedOn>Document.ЛистНабора</basedOn>
  <attributes>
    <name>НоменклатураОсновная</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗаводское</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеверныхШтучныхКодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеправильногоСодержимогоКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтклонениеОтЗаводскогоКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеПолныйКороб</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСканирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛинейныхШК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Сканировщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстQR</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>85</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеОшибки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставБригады</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПроверкаПоставкиМаркированногоТовара/ObjectModule.bsl
#Область СобытияДокумента

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = Маркировка_ПИ.ЭтотУзел_Код("Основной")+"-";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда Возврат; КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	ДокОснование = ДанныеЗаполнения;
	
	Дата = ТекущаяДатаСеанса();
	НачалоСканирования = ТекущаяДатаСеанса();
	
	УстановитьНовыйНомер();
	
	Если ЗначениеЗаполнено(Сканировщик) Тогда
	
		НайденныеСтроки = СоставБригады.НайтиСтроки(Новый Структура("Сотрудник", Сканировщик));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = СоставБригады.Добавить();
			НоваяСтрока.Сотрудник = Сканировщик;
		КонецЕсли;
		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////////////////////////
	
	Товары.Загрузить(ДокОснование.Товары.Выгрузить());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокОснование", ДокОснование);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковок.ШтрихкодУпаковки.Владелец КАК Номенклатура,
	|	ШтрихкодыУпаковок.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
	|	ВЫРАЗИТЬ(ШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК СТРОКА(31)) КАК ТекстQR
	|ИЗ
	|	Документ.ЛистНабора.ШтрихкодыУпаковок КАК ШтрихкодыУпаковок
	|ГДЕ
	|	ШтрихкодыУпаковок.Ссылка = &ДокОснование";
	
	УстановитьПривилегированныйРежим(Истина);
	тзШтрихкодыУпаковок = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	ШтрихкодыУпаковок.Загрузить(тзШтрихкодыУпаковок);
	
	///////////////////////////////////////////////////////////////////////////////////////////////
	//  КодАгрегации - НЕ Штука (Блочок или Коробка)
	///////////////////////////////////////////////////////////////////////////////////////////////
	
	Если Товары.Количество() > 0 Тогда
		НоменклатураОсновная = Товары[0].Номенклатура;
	КонецЕсли;
	
	Если ШтрихкодыУпаковок.Количество() > 0 Тогда
		Для Каждого Стр ИЗ ШтрихкодыУпаковок Цикл
			Если Стр.ШтрихкодУпаковки.ТипШК <> Перечисления.ТипыШтрихКодов.Штука Тогда
				КодАгрегации = Стр.ШтрихкодУпаковки;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Сканировщик) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен <Сканировщик> !!!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НоменклатураОсновная) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена <Номенклатура Основная> !!!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодАгрегации) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен <Код Агрегации> !!!";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
